ЕРПУХАстенд.cbr_Основной/src/Documents/ЭтапПроизводства2_2/ЭтапПроизводства2_2.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="03503ac6-a4b9-4d70-b0ef-949dac7b8de4">
  <name>ЭтапПроизводства2_2</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="38ea66f4-5bfa-48f1-8431-a99d27fcf31d">
    <name>ДатаПроизводства</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="d4429caf-ac6e-49ad-bef0-355badcab738">
    <name>КоличествоУпаковокПлан</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="e4bc4c5c-4c75-4666-8d21-f7f403a23514">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="cef36287-09dd-4448-9e9e-5c90a8111d2c">
    <name>НаименованиеЭтапа</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Очередь</name>
    <comment>// Османов Н.М. 28.11.2023 ЧТЗ №2 Управление производством</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>31</precision>
        <scale>15</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="e9606203-88e5-4b62-bc25-9f152c0eecfe">
    <name>ПартияПроизводства</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="9e76279a-4f34-44a9-b997-752bfa2a4a30">
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>РабочийЦентр</name>
    <comment>// Османов Н.М. 27.11.2023 ЧТЗ №2 Управление производством</comment>
    <type>
      <types>CatalogRef.РабочиеЦентры</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="d12a6578-0ee7-4c40-a0c0-f24b03afa6bc">
    <name>Распоряжение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="0662487e-07e7-4fe3-b008-ffb293a9f154">
    <name>Спецификация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="49fb8c7a-a984-433d-9013-98b3f1808eba">
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="2e72bf9d-e251-478c-bd3e-7fb8e78584c0">
    <name>ТребуетсяЗаполнитьПоОперациям</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="88bb5796-07b6-4854-bafc-05701368c7dc">
    <name>ФактическоеНачалоЭтапа</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="97258e31-badf-4c52-808f-88d24f4369d1">
    <name>ФактическоеОкончаниеЭтапа</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="d65a15ce-a56d-4017-bbbc-210858c2c05f">
    <name>Этап</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="273df2c3-514f-4b41-af58-a60420b68979">
    <name>КоличествоУпаковокФакт</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>П3_СлужебныйПересчетВыпуска</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Действия</name>
    <comment>// Османов Н.М. 21.11.2023 ЧТЗ №Действия в производстве</comment>
    <attributes>
      <name>Действие</name>
      <type>
        <types>CatalogRef.ДействияПроизводства</types>
      </type>
    </attributes>
    <attributes>
      <name>Продолжительность</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяНачалаПлан</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ВремяНачалаФакт</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ВремяЗавершенияПлан</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ВремяЗавершенияФакт</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>ВнесеноПлан</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВнесеноФакт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТемператураПлан</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>7</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТемператураФакт</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>7</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДавлениеПлан</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>7</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДавлениеФакт</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>7</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СкоростьВращенияПлан</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>7</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СкоростьВращенияФакт</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>7</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Выполнено</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="f0cdedc1-9f3a-4821-ab6c-f2792fa18854">
    <name>ВыходныеИзделияСерии</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="028a2250-ffdf-406c-868f-fb624d295146">
      <name>Серия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="96e6c801-bf9a-48f0-9e19-1f68a05fe6eb">
    <name>ОбеспечениеМатериаламиИРаботами</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="2849e137-bfbf-4c16-b65f-8183ef3dcfd6">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="e615f87c-b1fe-424a-ba73-2107af37992d">
      <name>Упаковка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="fc5c02ab-4758-47ca-a469-aeac95072209">
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="dc035f49-1f37-4bf6-a369-751f132442a2">
    <name>ВыходныеИзделия</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="20aa6e93-6a18-4526-830f-8d45d3e04bb6">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>П3_НазначениеДоПересчета</name>
      <type>
        <types>CatalogRef.Назначения</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ЕРПУХАстенд.cbr_Основной/src/Documents/ЭтапПроизводства2_2/Forms/cbr_ФормаПодбораЭтапов/Module.bsl
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Изделие = Параметры.Изделие;
	ХарактеристикаИзделия = Параметры.ХарактеристикаИзделия;
	СсылкаНаТекущийЭтап = Параметры.СсылкаНаТекущийЭтап;
	
	ЗаполнитьЭтапыПроизводства();
	
КонецПроцедуры
#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура Перенести(Команда)
	
	ЕстьВыбрано = ?(ЭтапыПроизводства.НайтиСтроки(Новый Структура("Выбран",Истина)).Количество() > 0, Истина, Ложь);
	
	Если ЕстьВыбрано Тогда
		
		ДанныеВозврата = Новый Структура;
		ДанныеВозврата.Вставить("АдресТЗДанных", ВыгрузитьНаСервере());
		
		ВладелецФормы.cbr_ВозвратРезультатаПодбораЭтапов(ДанныеВозврата);
		Закрыть(); 
	Иначе
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Выберите хотя бы один элемент'"));
	КонецЕсли;

КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ВыгрузитьНаСервере()
	
	ЭтапыПроизводстваСОтбором = ЭтапыПроизводства.НайтиСтроки(Новый Структура("Выбран",Истина));
	
	МассивЭтапов = Новый Массив();
	Для Каждого Строка Из ЭтапыПроизводстваСОтбором Цикл
		МассивЭтапов.Добавить(Строка.Этап);
	КонецЦикла;

	Возврат ПоместитьВоВременноеХранилище(МассивЭтапов);	
	
КонецФункции

&НаСервере
Процедура ЗаполнитьЭтапыПроизводства()
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	|	ДвижениеПродукцииИМатериалов.Распоряжение КАК Распоряжение
	|ПОМЕСТИТЬ ВТПередачаМатериаловВПроизводство
	|ИЗ
	|	Документ.ДвижениеПродукцииИМатериалов КАК ДвижениеПродукцииИМатериалов
	|ГДЕ
	|	ДвижениеПродукцииИМатериалов.Проведен
	|	И ДвижениеПродукцииИМатериалов.Распоряжение ССЫЛКА Документ.ЭтапПроизводства2_2
	|СГРУППИРОВАТЬ ПО
	|	ДвижениеПродукцииИМатериалов.Распоряжение
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Распоряжение
	|ИЗ
	|	Документ.РасходныйОрдерНаТовары.ТоварыПоРаспоряжениям КАК РасходныйОрдерНаТоварыТоварыПоРаспоряжениям
	|ГДЕ
	|	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка.Проведен
	|	И РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Распоряжение ССЫЛКА Документ.ЭтапПроизводства2_2
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЭтапПроизводства2_2.Ссылка КАК Этап,
	|	ЭтапПроизводства2_2.КоличествоУпаковокПлан КАК Количество
	|ИЗ
	|	Документ.ЭтапПроизводства2_2 КАК ЭтапПроизводства2_2
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПередачаМатериаловВПроизводство КАК ВТПередачаМатериаловВПроизводство
	|		ПО ВТПередачаМатериаловВПроизводство.Распоряжение = ЭтапПроизводства2_2.Ссылка
	|ГДЕ
	|	ЭтапПроизводства2_2.ПартияПроизводства.ОсновноеИзделиеНоменклатура = &ОсновноеИзделиеНоменклатура
	|	И ЭтапПроизводства2_2.ПартияПроизводства.ОсновноеИзделиеХарактеристика = &ОсновноеИзделиеХарактеристика
	|	И ВТПередачаМатериаловВПроизводство.Распоряжение ЕСТЬ NULL
	|	И ЭтапПроизводства2_2.Ссылка <> &Ссылка";
	
	Запрос.УстановитьПараметр("ОсновноеИзделиеНоменклатура", Изделие);
	Запрос.УстановитьПараметр("ОсновноеИзделиеХарактеристика", ХарактеристикаИзделия);
	Запрос.УстановитьПараметр("Ссылка", СсылкаНаТекущийЭтап);
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	ЭтапыПроизводства.Загрузить(Результат);

КонецПроцедуры

#КонецОбласти
